{
  "Accessibility": {
    "skipToContent": "Skip to content"
  },
  "Nav": {
    "home": "Home",
    "projects": "Projects",
    "reading": "Reading",
    "toolbox": "Toolbox",
    "ama": "AMA",
    "mainNav": "Main navigation"
  },
  "Controls": {
    "theme": "Theme",
    "switchToLight": "Switch to light theme",
    "switchToDark": "Switch to dark theme",
    "lightShort": "Light",
    "darkShort": "Dark",
    "language": "Language"
  },
  "Home": {
    "eyebrow": "Personal Site",
    "title": "Craft-focused portfolio and practical toolbox.",
    "description": "A bilingual personal space for projects, notes, and useful utilities, with calm motion language and clear reading hierarchy.",
    "primaryCta": "Explore Projects",
    "secondaryCta": "Open Toolbox",
    "signalsLabel": "Home highlights",
    "signalOneTitle": "Built as a cohesive system",
    "signalOneSummary": "Shared tokens keep typography, surfaces, and interaction behavior consistent.",
    "signalTwoTitle": "Performance-first interaction",
    "signalTwoSummary": "Motion is restrained and measurable so dense pages remain smooth and readable.",
    "signalThreeTitle": "Bilingual by default",
    "signalThreeSummary": "UI language, navigation flow, and key controls stay aligned in both EN and 中文.",
    "projectsEyebrow": "Projects Preview",
    "projectsTitle": "Recent work with clear intent and strong utility.",
    "projectsSubtitle": "Short snapshots now, full case studies next.",
    "projectOneTitle": "Personal Site System",
    "projectOneSummary": "Scalable visual tokens, bilingual routing, and interaction foundations for long-term maintainability.",
    "projectOneMeta": "Design System · Next.js",
    "projectTwoTitle": "Motion Runtime Architecture",
    "projectTwoSummary": "Single-loop pointer runtime and quality tiers for stable performance under variable device load.",
    "projectTwoMeta": "Performance · Interaction",
    "projectThreeTitle": "AMA Minimal Product",
    "projectThreeSummary": "Route handlers, lightweight storage, and baseline anti-abuse controls with simple operations.",
    "projectThreeMeta": "API · Reliability",
    "projectAction": "View snapshot",
    "toolboxEyebrow": "Toolbox Preview",
    "toolboxTitle": "Small tools, direct workflows.",
    "toolboxSubtitle": "Focused interfaces that solve frequent utility tasks without setup overhead.",
    "toolOneTitle": "Base64 Utility",
    "toolOneSummary": "Encode and decode text payloads quickly with copy-ready output.",
    "toolTwoTitle": "Text Utilities",
    "toolTwoSummary": "Normalize, trim, and clean raw text blocks for daily drafting workflows.",
    "toolThreeTitle": "Document Translate UI",
    "toolThreeSummary": "Upload a document, preview translated output, and prepare follow-up edits.",
    "toolAction": "Open"
  },
  "Projects": {
    "title": "Projects",
    "description": "A minimal placeholder list for upcoming project write-ups.",
    "itemOneTitle": "Personal Site System",
    "itemOneDescription": "Visual system and interaction groundwork for the bilingual site.",
    "itemTwoTitle": "Toolbox Foundations",
    "itemTwoDescription": "Reusable architecture for Base64, text utilities, and document translation UI."
  },
  "Toolbox": {
    "eyebrow": "Tool Collection",
    "title": "Toolbox",
    "description": "A scalable framework where each utility follows the same interaction language: clear input, clear output, and predictable actions.",
    "workspaceEyebrow": "Workbench",
    "workspaceTitle": "Modular utility workspace",
    "workspaceDescription": "Add a new tool by registering one config and one panel component.",
    "searchPlaceholder": "Search by title or capability",
    "emptySearch": "No tools matched your search.",
    "categories": {
      "encoding": "Encoding",
      "text": "Text",
      "document": "Document"
    },
    "common": {
      "input": "Input",
      "output": "Output",
      "run": "Run",
      "copy": "Copy",
      "copied": "Copied",
      "clear": "Clear",
      "copyFailed": "Copy failed. Please copy manually."
    },
    "tools": {
      "base64": {
        "title": "Base64 Encode / Decode",
        "description": "Convert between UTF-8 text, binary files, and Base64 payloads with proper validation.",
        "tags": "base64 encode decode file text binary",
        "navHint": "Text and file payload conversion",
        "modeEncode": "Encode",
        "modeDecode": "Decode",
        "sourceText": "Text",
        "sourceFile": "File",
        "inputPlaceholder": "Paste plain text or Base64 payload...",
        "fileHint": "Choose a file to transform.",
        "fileSelected": "{name} · {bytes} bytes",
        "defaultDownload": "decoded-output.bin",
        "binaryOutput": "Binary output detected ({bytes} bytes). Use download to get the decoded file.",
        "outputPlaceholder": "Converted result will appear here.",
        "downloadDecoded": "Download decoded file",
        "errors": {
          "emptyInput": "Please provide input text first.",
          "fileRequired": "Please choose a file before running.",
          "decodeInvalid": "Invalid Base64 payload. Please verify input."
        }
      },
      "text": {
        "title": "Text Utilities",
        "description": "Apply trim, whitespace normalization, case conversion, and optional JSON pretty formatting in one pipeline.",
        "tags": "trim normalize whitespace uppercase lowercase title case json pretty",
        "navHint": "Clean and format text blocks",
        "inputPlaceholder": "Paste raw text, log output, or JSON here...",
        "outputPlaceholder": "Processed text will appear here.",
        "options": {
          "trim": "Trim edges",
          "normalizeWhitespace": "Normalize whitespace",
          "jsonPretty": "JSON pretty"
        },
        "case": {
          "none": "Case: keep",
          "upper": "UPPER",
          "lower": "lower",
          "title": "Title"
        },
        "errors": {
          "emptyInput": "Please enter text before processing.",
          "invalidJson": "JSON pretty failed. Input is not valid JSON."
        }
      },
      "doc": {
        "title": "Doc Translate",
        "description": "Phase 1 text translation workflow backed by `/api/translate` and OpenAI Responses API.",
        "tags": "document translate api upload language glossary",
        "navHint": "Text translation via API",
        "apiBadge": "Text API",
        "sourceLanguage": "Source language",
        "targetLanguage": "Target language",
        "tone": "Tone",
        "languages": {
          "auto": "Auto detect",
          "zh": "Chinese",
          "en": "English",
          "ja": "Japanese"
        },
        "tones": {
          "balanced": "Balanced",
          "formal": "Formal",
          "concise": "Concise"
        },
        "inputPlaceholder": "Paste document text here, or upload a plain text file below.",
        "fileLabel": "Upload source file",
        "fileHint": "Supports plain text documents in phase 1.",
        "fileSelected": "{name} · {bytes} bytes",
        "glossaryPlaceholder": "Optional glossary, one term per line.",
        "outputPlaceholder": "Translation output will appear here.",
        "running": "Translating...",
        "errors": {
          "emptyInput": "Please provide source text or upload a file.",
          "fileTooLarge": "File is too large. Keep it under 2 MB for phase 1.",
          "rateLimited": "Too many requests. Please wait and try again.",
          "serviceUnavailable": "Translation service is not configured yet.",
          "generic": "Unable to generate translation right now."
        }
      }
    }
  },
  "Writing": {
    "eyebrow": "Writing",
    "title": "Interface notes focused on reading flow.",
    "description": "Process notes on restrained motion, visual rhythm, and clarity-first interaction patterns.",
    "openArticle": "Read article",
    "hudLabel": "Reading HUD",
    "articles": [
      {
        "slug": "interaction-rhythm",
        "eyebrow": "Interaction Notes",
        "title": "Rhythm Before Decoration",
        "summary": "Subtle delays and tiny movement can guide attention better than louder visual effects.",
        "readingTime": "7 min read",
        "intro": "Motion is only useful when it protects reading flow. Once animation starts competing with paragraph rhythm, the content loses priority.",
        "sections": [
          {
            "title": "Keep motion measurable",
            "paragraphs": [
              "Micro-interactions work best when they are barely above perception threshold. A one-pixel lift can feel intentional without becoming ornamental.",
              "Delayed icon motion is effective because it reinforces hierarchy. Text stabilizes first, then the icon confirms intent a fraction later.",
              "A calm hover system should improve scan speed. If users remember the animation more than the label, the balance is wrong.",
              "Treat every transition as a reading aid. It should clarify what changed, not advertise itself."
            ]
          },
          {
            "title": "Guide attention with one anchor",
            "paragraphs": [
              "Long pages need orientation, but they do not need decoration running through the full viewport.",
              "A compact progress hint plus one high-contrast paragraph dot gives enough wayfinding for dense text.",
              "IntersectionObserver is a practical trigger. It keeps activation logic stable while avoiding heavyweight scroll handlers.",
              "When the active marker moves, interpolation should stay mild. The goal is continuity, not a dramatic chase effect."
            ]
          },
          {
            "title": "Design for reduced motion first",
            "paragraphs": [
              "Reduced motion is not a degraded experience. It is a different contract where state changes remain clear without animated travel.",
              "Direct positioning can still communicate progress and active context, as long as contrast and spacing are reliable.",
              "Keyboard users should get the same clarity as pointer users. Focus rings and semantic order remain the primary interaction language.",
              "A crafted interface is one that remains legible under every preference mode."
            ]
          }
        ]
      },
      {
        "slug": "toolbox-handbook",
        "eyebrow": "Tooling Notes",
        "title": "Toolbox Entries as Interface Handbook",
        "summary": "Utility cards should read like concise manual entries: what it is, what it does, and what to do next.",
        "readingTime": "6 min read",
        "intro": "A practical toolbox does not need loud visuals. It needs predictable structure and quick scan cues that reduce decision time.",
        "sections": [
          {
            "title": "Write cards for scanning",
            "paragraphs": [
              "Each card should answer three questions immediately: what tool this is, what outcome it provides, and where the interaction starts.",
              "A compact icon, short title, and single-line summary produce a reliable rhythm across tools.",
              "Secondary guidance can be lightweight. A small uppercase hint works better than additional button clutter.",
              "Consistency matters more than novelty. Repeated structure reduces cognitive load on return visits."
            ]
          },
          {
            "title": "Use one accent language",
            "paragraphs": [
              "Accents should indicate action priority, not decorate every surface.",
              "Border highlight, faint surface sheen, and tiny elevation shifts are usually enough to signal interactivity.",
              "When every element glows, none of them guide. Keep high-contrast states reserved for active selection and focus.",
              "The same motion token set should drive cards, buttons, and nav so the interface feels coherent."
            ]
          },
          {
            "title": "Preserve maintainability",
            "paragraphs": [
              "Interaction polish should live in reusable primitives. Copy-pasting custom hover logic into pages makes drift inevitable.",
              "Tokens for duration, easing, and delays keep craft consistent while still allowing local nuance.",
              "Performance constraints are part of design quality. Avoid animations that force layout or repaint large regions.",
              "The best toolbox UI is quiet, fast, and clear enough that users focus on work, not chrome."
            ]
          }
        ]
      }
    ]
  },
  "AMA": {
    "title": "AMA",
    "description": "Ask a question or leave a message. New posts appear in the public list below.",
    "nameLabel": "Name",
    "emailLabel": "Email",
    "messageLabel": "Message",
    "submit": "Send message",
    "sending": "Sending...",
    "success": "Thanks. Your message was received.",
    "error": "Something went wrong. Please try again.",
    "rateLimited": "Too many requests. Please wait a minute and try again.",
    "listTitle": "Recent messages",
    "listLoading": "Loading messages...",
    "listLoadError": "Could not load messages. Try refresh.",
    "listEmpty": "No messages yet. Be the first one to ask.",
    "refresh": "Refresh"
  },
  "ReadingDemo": {
    "eyebrow": "Reading Guide Demo",
    "title": "Scroll-aware guidance with progress and paragraph focus.",
    "intro": "This page demonstrates a compact reading guide: a short progress meter plus a high-contrast dot that moves to the active paragraph start.",
    "sections": [
      {
        "title": "Why this pattern",
        "paragraphs": [
          "A long page can feel directionless when every paragraph has equal visual weight. A small progress indicator gives orientation without competing with content.",
          "The guide dot is deliberately minimal. It marks where attention can return after a scroll jump, especially on dense writing pages.",
          "The layout avoids a full-height decorative line. Instead, progress is contained in a short capsule so the interface stays quiet.",
          "In practice, this pattern works best when typography is comfortable and spacing between paragraphs remains consistent."
        ]
      },
      {
        "title": "Interaction details",
        "paragraphs": [
          "Section activation is driven by IntersectionObserver. Paragraphs become candidates when they enter a focused window in the viewport.",
          "When several paragraphs overlap, scoring prefers the one closest to a reading focus line near the upper part of the screen.",
          "Scroll updates are batched with requestAnimationFrame so progress remains smooth without heavy per-event work.",
          "The guide dot uses small movement and clear contrast, which keeps the signal useful but subtle."
        ]
      },
      {
        "title": "Accessibility and fallback",
        "paragraphs": [
          "With reduced motion enabled, animated following is disabled. The system still reports progress and updates guidance without motion effects.",
          "The reading guide is decorative and marked as aria-hidden so keyboard and screen-reader navigation stay clean.",
          "The component is route-agnostic and works in both locale prefixes, as long as anchors are marked with data-reading-anchor.",
          "This keeps the implementation maintainable while preserving a polished reading experience."
        ]
      }
    ]
  }
}
